<?php
$eng1=chr(rand(65,90));
$eng2=chr(rand(65,90));

echo $eng1.$eng2;

echo "<br>";


//產生10碼混合英數大小寫的亂碼:
$random=10;
//FOR回圈以$random為判斷執行次數(也就是亂碼位數)
$result="";
for ($i=1;$i<=$random;$i=$i+1)
{
    //亂數$c設定三種亂數資料格式大寫、小寫、數字，隨機產生
    $c=rand(1,3);
    //在$c==1的情況下，設定$a亂數取值為97-122之間，並用chr()將數值轉變為對應英文，儲存在$b
    if($c==1){$a=rand(97,122);$b=chr($a);}
    //在$c==2的情況下，設定$a亂數取值為65-90之間，並用chr()將數值轉變為對應英文，儲存在$b
    if($c==2){$a=rand(65,90);$b=chr($a);}
    //在$c==3的情況下，設定$b亂數取值為0-9之間的數字
    if($c==3){$b=rand(0,9);}
    //使用$ra連接並累加結果
    $result=$result.$b;
}
//輸出$ra每次更新網頁，亂數重新產生了

echo $result;


?>